# Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N в виде списка.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]

# Пример:
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# N = int(input('Введите число: '))
# f = 1
# for i in range(1, N + 1):
#     f = i * f
#     print(f, end = " ")


factorial = []
n = (int(input('введите число n: ')))
f = 1
for i in range(1, n + 1):
    f = i * f
    factorial.append(f)
print(factorial)

